In [2]:
import pandas as pd

In [15]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data)
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

### Column selection

In [16]:
# Select column
df[['Age', 'Address']]

   Age    Address
0   27      Delhi
1   24     Kanpur
2   22  Allahabad
3   32    Kannauj

In [17]:
# Add column
scores = [80, 90, 75, 85]
df['score'] = scores
passes = [True, True, False, True]
df['passed'] = passes
df

     Name  Age    Address Qualification  score  passed
0     Jai   27      Delhi           Msc     80    True
1  Princi   24     Kanpur            MA     90    True
2  Gaurav   22  Allahabad           MCA     75   False
3    Anuj   32    Kannauj           Phd     85    True

In [18]:
# Delete column
df.drop(['score', 'passed'], axis=1, inplace=True) # inplace parameter -> modify original data or not
df

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd

### Row selection

In [19]:
indexs = ['one', 'two', 'three', 'four']
df.index = indexs
df

         Name  Age    Address Qualification
one       Jai   27      Delhi           Msc
two    Princi   24     Kanpur            MA
three  Gaurav   22  Allahabad           MCA
four     Anuj   32    Kannauj           Phd

In [20]:
# using loc() or iloc() for row

print(df.loc[['one', 'three']])
print()
print(df.iloc[[1, 2]])
print()
print(df.iloc[0:3])

         Name  Age    Address Qualification
one       Jai   27      Delhi           Msc
three  Gaurav   22  Allahabad           MCA

         Name  Age    Address Qualification
two    Princi   24     Kanpur            MA
three  Gaurav   22  Allahabad           MCA

         Name  Age    Address Qualification
one       Jai   27      Delhi           Msc
two    Princi   24     Kanpur            MA
three  Gaurav   22  Allahabad           MCA

In [21]:
# Add new row
newData = ['Trinh', 27, 'VietNam', 'BA']
df.loc['five'] = newData
df

         Name  Age    Address Qualification
one       Jai   27      Delhi           Msc
two    Princi   24     Kanpur            MA
three  Gaurav   22  Allahabad           MCA
four     Anuj   32    Kannauj           Phd
five    Trinh   27    VietNam            BA

In [23]:
# Delete row
df.drop(['five'], inplace=True)
df

         Name  Age    Address Qualification
one       Jai   27      Delhi           Msc
two    Princi   24     Kanpur            MA
three  Gaurav   22  Allahabad           MCA
four     Anuj   32    Kannauj           Phd

### Selecting and Indexing

In [25]:
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}

df = pd.DataFrame(data, index=['one', 'two', 'three', 'four'])
df

         Name  Age    Address Qualification
one       Jai   27      Delhi           Msc
two    Princi   24     Kanpur            MA
three  Gaurav   22  Allahabad           MCA
four     Anuj   32    Kannauj           Phd

In [26]:
# Slect specific row and column
df.loc[['one', 'three'], ['Name', 'Address']]

         Name    Address
one       Jai      Delhi
three  Gaurav  Allahabad

In [27]:
# iloc

In [32]:
df.iloc[0:3, 0:2]

         Name  Age
one       Jai   27
two    Princi   24
three  Gaurav   22